summit2013/lab4/src/test/resources/xml/income-good.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"	xmlns:urn="http://mortgages/">
	<soapenv:Body>
		<urn:applicant>
			<age>34</age>
			<applicationDate>2013-04-05</applicationDate>
			<name>Baby Face</name>
			<loanAmount>50000.00</loanAmount>
			<income>20000.00</income>
		</urn:applicant>
	</soapenv:Body>
</soapenv:Envelope>